CSI API ETABS v1
cPointObj.GetSpecialPoint Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSpecialPoint(
	string Name,
	ref bool SpecialPoint
)
Function GetSpecialPoint (
	Name As String,
	ByRef SpecialPoint As Boolean
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim SpecialPoint As Boolean
Dim returnValue As Integer
returnValue = instance.GetSpecialPoint(Name,
	SpecialPoint)
int GetSpecialPoint(
	String^ Name,
	bool% SpecialPoint
)
abstract GetSpecialPoint :
        Name : string *
        SpecialPoint : bool byref -> int
Parameters
Name
Type: System.String
SpecialPoint
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cPointObj Interface
ETABSv1 Namespace